{"title":"Flinders Street Station upgrade","date":"2020-03-02","eventImage":null,"articleContent":"<h1>Flinders Street Station upgrade</h1> <p></p> <p>Melbourne’s iconic Flinders Street Station is nearing the end of a $100 million-dollar upgrade to ensure that our city landmark is protected for current and future generations. Works are due for completion by mid-2020.</p><p>The Flinders Street Station Upgrade is being delivered in two programs: repair and restoration to the main administration building, and works to improve the passenger experience including improved passenger traffic flow and amenities.</p><h2><strong>Completed Works</strong></h2><h3><strong>Flinders Street Station original colours and façade repairs</strong></h3><p>Flinders Street has been repainted five times since the early 1900s. Determining the original colours involved detailed forensic analysis by the University of Melbourne, to peel back the layers and find the original paint.</p><p>The station's exterior has now been restored to its original 1910 colour scheme and the majestic grandeur that its architects, Fawcett and Ashworth, originally intended.</p><p>More than 5000 litres of paint were used to repaint the station.</p><p>The works included extensive restoration and repairs of the façade, awning, doors and windows which have all been returned to their original colour scheme.</p><h3><strong>Flinders Street Station clock restoration and tower stabilisation</strong></h3><p>The historic Flinders Street Station clock was built by Melbourne clock maker F. Zeigler and was installed in 1907.</p><p>In early 2018, contractors temporarily stopped the clock, stabilised the clock tower’s structure and repaired the mechanism.</p><p>Cleaning in the clock tower included the removal of 10 tonnes of bird guano.</p><p>These works give renewed life to this much loved iconic feature of Melbourne’s cityscape.</p><h3><strong>Elizabeth Street Subway access improvements</strong></h3><p>Access within Flinders Street Station was improved with the reopening of an original internal staircase connecting the subway and Platform 1.</p><p>A new entry from the western end of Platform 10 allows passengers to directly access Northbank and platforms 10, 12 and 13.</p><p>This new entrance features next-generation myki barriers, ticketing facilities, weather protection and lighting.</p><h3><strong>Toilet refurbishment</strong></h3><p>The Elizabeth Street subway toilets have been fully refurbished, with all original heritage features maintained.</p><p>The location of the male and female toilets was swapped based on size and layout to better service the users of each facility.</p><p>Unisex accessible and parent-room facilities have also been included in the refurbishment.</p><p>The main concourse toilets also received a complete refurbishment as part of the project.</p><p>Capacity in both the male and female toilets has been increased to reduce waiting time during peak periods as well as improving access to the DDA compliant bathroom.</p><h3>New Pedestrian Information Displays (PIDs) and wayfinding signage installation</h3><p>New colour coded Pedestrian Information Displays (PIDs) have been installed at Flinders Street Station. Train lines featured on the displays have been assigned unique colours to improve navigation for commuters.</p><p>Additionally, new wayfinding signage has been installed to help commuters find their way around the station.</p><h3>Platform passenger flow improvements</h3><p>Old platform seating and all kiosks and vending machines have been removed from the platform area to improve passenger flow. The old platform seating has been replaced by new seating.</p><h3><span>Degraves Street underpass improvements</span></h3><p>The Degraves Street underpass has been upgraded with new myki barriers, lighting and wayfinding.</p><h2>Next steps</h2><h3>Heritage Banners</h3><p>The historic Flinders Street Station platform signs are being removed so they can undergo some essential restoration works. The signs all have varying levels of rust stains, rotting timbers and paint deterioration.</p><p>The signs will be removed at night from Sunday 2 March 2020. It is expected that it will take 3 to 4 nights to remove the six historic signs.   <br /> <br /> The signs will be taken to Lilydale and restored by heritage restoration specialists, who have previously worked across other elements of the Flinders Street Station upgrade.</p><p>This restoration process is quite complex and will take approximately 8 to 10 weeks to be completed.</p>","articleDescription":"The Flinders Street Station Upgrade is being delivered in two programs: repair & restoration to the main building and works to improve the passenger experience.","pdfLinks":[],"category":[],"imgLinks":[]}