{"title":"Minor route change for bus routes 511, 525 and Seymour Night Coach","date":"2021-08-29","eventImage":null,"articleContent":"<h1>Minor route change for bus routes 511, 525 and Seymour Night Coach</h1> <p></p> <p>From 29 August 2021, bus <a href=\"https://www.ptv.vic.gov.au/route/15030/511-donnybrook-station-to-mandalay-via-olivine\">Route 511 Donnybrook Station to Mandalay via Olivine</a>, bus <a href=\"https://www.ptv.vic.gov.au/route/15544/525-donnybrook-station-to-craigieburn-station-via-mickleham\">Route 525 Donnybrook Station to Craigieburn Station via Mickleham</a> and the <a href=\"https://www.ptv.vic.gov.au/route/1710/seymour-melbourne-via-broadmeadows\">Melbourne - Seymour Night Coach</a> will access Donnybrook Station Bus Interchange via an altered route through Cloverton Boulevard and Station Parade.</p><p>Road changes at the Springs Road and Donnybrook Road intersection are impacting access to Donnybrook Station, traffic will only be able to travel left in and out of Springs Road.</p><p>All services that currently access Donnybrook Station Bus Interchange via a right turn in and out of Springs Road will now access the bus interchange via Cloverton Boulevard and Station Parade.</p><p>Four new bus stops will be built along Cloverton Boulevard and Station Parade for Route 525 only. Route 511 and Seymour Night Coach won’t stop along this new section of the route.</p><p>There will be a minor timetable adjustment for Route 525. Please view the <a href=\"https://www.ptv.vic.gov.au/route/15544/525-donnybrook-station-to-craigieburn-station-via-mickleham#RoutePage:::datetime=2021-08-29T02%3A05%3A00.000Z&amp;direction_id=125&amp;stop_id=-1&amp;_auth=46067edc0e3d1608e20f8b0bfdcf26d43c714f9ec27552f96cc79cbcb00f38c4\">Route 525</a> timetable before travelling.</p><p>To plan your journey, visit the <a href=\"https://ptv.vic.gov.au/journey/\">Journey planner</a> or call <a href=\"https://www.ptv.vic.gov.au/footer/customer-service/public-transport-call-centre/\">1800 800 007</a> to order a printed copy of your timetable.</p>","articleDescription":"From Aug 2021, bus routes 511, 525 and Seymour Night Coach will access Donnybrook Station Bus Interchange via an altered route.","pdfLinks":[],"category":[],"imgLinks":[]}