{"title":"New bus service for Uni Melb and Parkville Precinct and changes to Route 546","date":"2021-09-20","eventImage":null,"articleContent":"<h1>New bus service for Uni Melb and Parkville Precinct and changes to Route 546</h1> <p></p> <p><span>From Monday 20 September 2021, new bus service Route 202 Yarra Bend to Melbourne University will better connect Victoria Park Station to the University of Melbourne and Parkville’s medical and research precinct. </span></p><p>New Route 202 is a limited stops service and will run every 10 minutes between 7am and 7pm on weekdays, including Labour Day and Melbourne Cup Day.</p><p>The high-frequency shuttle bus will also pick up passengers from stops on the 11, 86 and 96 tram routes, providing a more efficient and comfortable way for students, workers and medicos to reach the precinct.</p><p>Route 202 will remove the need for commuters from Melbourne’s northern and north-eastern suburbs to travel into the CBD to catch university or Parkville-bound services.</p><p><a href=\"https://www.ptv.vic.gov.au/route/13797/202-yarra-bend-melbourne-university\"><u><span>Route 202 – Yarra Bend to Melbourne University</span></u></a> <span>departs from Yarra Bend Park and travels via Studley Park Rd, Johnston Street, Elgin Street, Lygon Street, Grattan Street, Swanston Street, terminating outside Melbourne University. On return, it departs Melbourne University and travels via Swanston Street, Elgin Street, Johnston Street, Studley Park Road terminating at Yarra Bend Park. The new timetable is available now.</span></p><p><span>Route 546 will have a new timetable but the number of services and trips across the week will remain the same. <a href=\"https://www.ptv.vic.gov.au/route/timetable/15220/546-heidelberg-station-melb-uni-queen-victoria-market-via-clifton-hill-and-carlton/\">View the new timetable for Route 546</a>.</span></p><p><span>To plan your journey, view the new timetables for <a href=\"https://www.ptv.vic.gov.au/route/13797/202-yarra-bend-melbourne-university#RoutePage__LineInformationAnchor\">Route 202</a> visit <a href=\"https://www.ptv.vic.gov.au/journey/\">Journey planner</a> or call <a href=\"https://www.ptv.vic.gov.au/footer/customer-service/public-transport-call-centre/\">1800 800 007</a> to order a printed copy of your timetable.</span></p>","articleDescription":"A new bus service Route 202 Yarra Bend to Melbourne University will better connect Victoria Park Station to the UoM & Parkville’s medical precinct.","pdfLinks":[],"category":[],"imgLinks":[]}