{"title":"Improved bus services for Mornington Peninsula","date":"2022-02-20","eventImage":null,"articleContent":"<h1>Improved bus services for Mornington Peninsula</h1> <p></p> <p>From Sunday 20 February 2022, Routes 781 and 887 will be upgraded to better connect residents and tourists to local attractions, work, education, and other transport services.</p><h3>Route 781 Frankston to Dromana</h3><ul><li>Route 781 will be extended to Dromana and provide better service coverage in the Mount Martha area.</li><li>The frequency of Route 781 will remain the same.</li></ul><p><a href=\"https://www.ptv.vic.gov.au/route/timetable/15504/781-frankston-dromana-via-mount-eliza-and-mornington-and-mount-martha/#RoutePage:::datetime=2022-02-19T20%3A33%3A00Z&amp;direction_id=231&amp;stop_id=-1&amp;_auth=00262f82578cfb120a841731cc62044ce1e1ed14f6819085fa37d87fb8f04dad\">Route 781 Frankston – Dromana</a> departs from the terminus at Frankston Station and runs via Young St, Playne St, Nepean Hwy, Old Mornington Rd, Mt Eliza Way, Nepean Hwy, Bungower Rd, Robertson Dr, Nepean Hwy, Main St, Eastern Ring Rd, Barkly St, Main St, Esplanade, Bay Rd, Dominion Rd, Somerset Dr, Forest Dr, Hearn Rd, Esplanade, Marine Dr, Victoria St, Dromana Pde, Nepean Hwy, Point Nepean Rd, O’Donohue St, Gibson St and Pier St to the terminus near Dromana Hub Shopping Centre.</p><h3>Route 887 Rosebud to Frankston</h3><ul><li>Route 887 will extend further into the Rosebud residential area along Boneo Road.</li><li>Route 887 will travel express via the Mornington Peninsula Freeway between Dromana and Frankston, reducing travel times and providing residents living in Rosebud, Macrae and Dromana with a more direct access to Monash University Peninsula Campus, Frankston Hospital and Frankston Station.  </li><li>The service will operate all year round including the weekends.</li><li>The frequency of the service will increase to hourly on weekdays and run every two hours on weekends.</li></ul><p><a href=\"https://www.ptv.vic.gov.au/route/timetable/15506/887-frankston-rosebud-via-monash-university-peninsula-campus/#RoutePage:::datetime=2022-02-19T21%3A50%3A00Z&amp;direction_id=252&amp;stop_id=-1&amp;_auth=02c948261b7ea837387ca1370771ceee3d6a50d8c97cee16495eecbdedf8f440\">Route 887 Rosebud – Frankston</a> departs from the terminus at Frankston Station and runs via Young St, Davey St, Hastings Rd, Moorooduc Hwy, Frankston-Flinders Rd, Mornington Peninsula Fwy, Nepean Hwy, Point Nepean Rd and Boneo Rd to the terminus at the corner of Boneo Rd and Besgrove St.</p><p>To plan your journey, visit <a href=\"https://ptv.vic.gov.au/journey/\">Journey planner</a> or call <a href=\"https://www.ptv.vic.gov.au/footer/customer-service/public-transport-call-centre/\">1800 800 007</a> to order a printed copy of your timetable.</p>","articleDescription":"From Sunday 2022, Routes 781 and 887 will be upgraded to better connect residents and tourists.","pdfLinks":[],"category":[],"imgLinks":[]}