{"title":"Minor route deviation and timetable change for bus Route 626","date":"2022-01-31","eventImage":null,"articleContent":"<h1>Minor route deviation and timetable change for bus Route 626</h1> <p></p> <p>From Monday 31 January 2022, in line with the first day of the new school year, <a href=\"https://www.ptv.vic.gov.au/route/15248/626-middle-brighton-chadstone-via-mckinnon-and-carnegie/#RoutePage__LineInformationAnchor\">Route 626</a> will deviate one AM and one PM service via East Boundary Road to drop off and pick up students within 400 metres of McKinnon Secondary College’s new East Bentleigh campus.</p><p>The route deviation will operate on school days only and coordinate with school bell times.</p><ul><li>The 7.31am service from Middle Brighton Station will depart at 7.37am.  </li><li>The 7.37am service from Middle Brighton Station and the 3pm service from Chadstone Shopping Centre, will deviate via East Boundary Road instead of Tucker Road. The service will re-join the scheduled route along Koornang Road and McKinnon Road.</li></ul><p>Three bus stops on Tucker Road between McKinnon Road and North Road will be bypassed during each AM/PM deviation. Passengers using these stops during a deviated route service will be able to use the alternative Route 626 bus stops located on either McKinnon Road or North Road.</p><p>Minor timetable changes are needed due to the deviations. These changes will have minimal impact on Route 626.</p><p>All other route 626 services and existing connections will be maintained including the timing points for Brighton Grammar School, Firbank Grammar School and both McKinnon Secondary College campuses. Route 626 will be co-ordinated with train services at Middle Brighton and Carnegie stations.</p><p><a href=\"https://www.ptv.vic.gov.au/route/15248/626-middle-brighton-chadstone-via-mckinnon-and-carnegie/#RoutePage__LineInformationAnchor\">View the new timetable for Route 626.</a></p><p>To plan your journey, visit <a href=\"https://ptv.vic.gov.au/journey/\">Journey planner</a> or call <a href=\"https://www.ptv.vic.gov.au/footer/customer-service/public-transport-call-centre/\">1800 800 007</a> to order a printed copy of your timetable.</p>","articleDescription":"From Jan 2022, Route 626 will deviate one AM and one PM service via East Boundary Road to provide better transport access to McKinnon Secondary College.","pdfLinks":[],"category":[],"imgLinks":[]}