{"title":"South Yarra Station Upgrade","date":"2022-07-21","eventImage":"https://www.ptv.vic.gov.au/assets/PTV-default-site/footer/about-ptv/improvements-and-projects/stations/9b34f44502/South-Yarra-Station-Project-Toorak-Road-station-entrance.JPG","articleContent":"<h1>South Yarra Station Upgrade</h1> <p></p> <p>We’ve upgraded South Yarra Station, one of Melbourne's busiest stations, as we also prepare our network for the Metro Tunnel.</p><p>The South Yarra Station Upgrade has created a safer and more accessible space, with improvements to the entrance area and amenities, a new canopy over the station entrance and an accessible tram stop on Toorak Road.</p><h3>Tram stop upgrade</h3><p>A new level-access tram stop is now open on Toorak Road. This final stage of work created a level-access tram stop that fully integrates with Melbourne's expanding fleet of low-floor trams. The new stop also includes new dedicated bike lanes to allow cyclists to safely travel past the tram stop and bike facilities on both sides of Toorak Road.</p><h3>Station upgrade</h3><p>Stage one and two of our major works to relieve congestion and improve accessibility at South Yarra Station are now complete.</p><p>The upgrade has provided more space for passengers with a new concourse area double its previous size, more myki gates, improved lighting, and an upgraded accessible ticket window. A new canopy over the station entrance provides more shelter for people outside the station on Toorak Road.</p><p>The completed station upgrade works include:</p><ul><li>widening the station entrance on Toorak Road to reduce congestion</li><li>constructing a new canopy over the station entrance to provide more shelter for people outside on Toorak Road</li><li>refurbishment of the concourse area with improved lighting, and finishes</li><li>upgrading ticketing and staff office facilities</li><li>increasing the number of myki gates and improving their layout</li><li>upgrading customer wayfinding.</li></ul><h3>Yarra Street - new traffic conditions at the Toorak Road intersection</h3><p>We trialled turning movement bans into and out of Yarra Street onto Toorak Road. The trial, which ran for 12 months (from June 2021 to June 2022) received positive feedback from the community. We are now working towards making the change permanent.</p><p>Vehicles will only be able to turn left out of Yarra Street onto Toorak Road. Right turns into and out of Yarra Street are banned as is the left turn into Yarra Street. Yarra Street will remain a two-way street.</p><p>The turn ban will continue to be enforced with the temporary infrastructure currently in place until early 2023, while a permanent solution is being designed.</p><p>We have sought stakeholder and community feedback during the trial through a range of channels, including a public survey on engage.vic.gov.au.</p><ul><li><span>Community feedback supports the changed turning movement, with feedback from Engage Vic showing 70% of respondents supported make the change permanent. </span></li><li><span>Feedback showed respondents felt the ban significantly improved pedestrian safety, as well as reduced the instance of near misses for vehicles trying to turn in and out of Yarra Street onto Toorak Road.</span></li></ul><p><span>The period to provide feedback has now closed.</span></p><h3>Join the conversation</h3><p>We're working closely with Rail Projects Victoria, Yarra Trams, Metro Trains Melbourne and the City of Stonnington to ensure a coordinated approach to construction activity. We will make every effort to minimise disruption to local residents and businesses.</p>","articleDescription":"Improvements to the South Yarra Station entrance & construction of an accessible tram stop on Toorak Road will allow passengers an easier and safer journey.","pdfLinks":[],"category":[],"imgLinks":[],"eventImageFile":"9b34f44502ee04447b65839608dfff96b2bf59bd"}