{"title":"Public transport for Spilt Milk: Saturday 2 December 2023","date":"2023-12-02","eventImage":"https://www.ptv.vic.gov.au/assets/PTV-default-site/Images/NextGen-App-news-article-banners/DTP0496-Melbourne-SpecialEvents-PTV-ContentHeader-1000x563px-FA.jpg","articleContent":"<h1>Public transport for Spilt Milk: Saturday 2 December 2023</h1> <p>Events &gt; Music</p> <p>Get ready for Spilt Milk at Victoria Park in Ballarat!</p><p>There will be additional services so you can get to and from the event easily on Saturday 2 December 2023.</p><p>Gates open from 11am to 11pm.</p><h2>Before you travel</h2><p>Plan your journey using <a href=\"https://ptv.vic.gov.au/journey/\">Journey planner</a> and check <a href=\"https://www.ptv.vic.gov.au/disruptions/disruptions-information/\">Disruptions</a> for service changes that may affect your journey.</p><p>Make your journey hassle-free and remember to <a href=\"https://www.ptv.vic.gov.au/tickets/myki/buy-a-myki-and-top-up/\">top up your myki</a> and have it ready to use before travelling.</p><p>Please refer to the <a href=\"https://spilt-milk.com.au/ballarat/\">Spilt Milk Ballarat website</a> for further event information, set times and accessibility information.</p><h2><img title=\"Regional train icon\" src=\"/assets/operator-logos/regional-train.svg\" alt=\"Regional train icon\" /> Regional train</h2><h3>Getting to Ballarat</h3><p>Passengers can catch regular services arriving at Ballarat Railway Station.</p><p>The following additional services will depart Southern Cross Station before the event:</p><ul><li><span>10.50am. Southern Cross to Ballarat. This service will stop at Caroline Springs, Rockbank, Cobblebank, Melton, Bacchus Marsh, Ballan, arriving at Ballarat at 12.16pm.</span></li></ul><h3>Leaving Ballarat</h3><p>Passengers can catch regular services departing Ballarat Railway Station.</p><p>The following additional services will depart Wendouree and Ballarat for Southern Cross Station after the event:</p><ul><li>11:30pm Wendouree to Southern Cross, arriving at Ballarat 11:34pm, departing Ballarat at 11:39pm and stopping all stations to Ardeer, then running express to Southern Cross arriving at 1:24am.</li><li>12:30am Wendouree to Southern Cross, arriving at Ballarat at 12:34am, departing Ballarat at 12:41am and stopping all stations to Ardeer, then running express to Southern Cross arriving at 2:14am.</li></ul><p>Plan your journey using <a href=\"https://ptv.vic.gov.au/journey/\">Journey planner</a> or download the V/Line timetable for services to and from Ballarat on 2 December 2023 <a href=\"vline-1728-2023-12-02-2023-12-02.pdf\">here</a>.</p><h2><img title=\"Bus icon\" src=\"/assets/operator-logos/bus.svg\" alt=\"Bus icon\" /><span> Metropolitan bus</span></h2><h3>Getting to Victoria Park, Ballarat</h3><p>Passengers arriving at Ballarat Station are advised to walk via Coffee Palace Lane to Mair Street and catch a connecting free shuttle bus to Victoria Park, from 9:30am to 6:30pm.</p><p>Please refer to the Spilt Milk website for further information on Free Shuttle services from Ballarat Station, including the East City and South City Shuttle Loops <a href=\"https://spilt-milk.com.au/ballarat/info/getting-to-from-spilt-milk-ballarat/\">here</a>.</p><h3>Leaving Victoria Park, Ballarat</h3><p>From 7pm, passengers travelling via the free shuttle bus will be depart Victoria Park from the designated Bus Zone on Gillies Street to Ballarat Station.</p><p>Please refer to the Spilt Milk website for further information on Free Shuttle services to Ballarat Station, including the East City and South City Shuttle Loops <a href=\"https://spilt-milk.com.au/ballarat/info/getting-to-from-spilt-milk-ballarat/\">here</a>.</p><p>Plan your journey using <a href=\"https://ptv.vic.gov.au/journey/\">Journey planner</a>.</p>","articleDescription":"Get ready for Spilt Milk at Victoria Park in Ballarat! There will be additional services so you can get to and from the event easily on Saturday 2 December 2023.","pdfLinks":["https://d1u8c9axrpru07.cloudfront.net/1700055180536/vline-1728-2023-12-02-2023-12-02.pdf"],"imgLinks":[],"category":["Events","Music"],"eventImageFile":"8d3002598fd4476760e9b23da9ba0280d2f07c02"}