{"title":"Better buses for Casey","date":"2023-06-25","eventImage":"https://www.ptv.vic.gov.au/assets/default-site/footer/about-ptv/improvements-and-projects/bus-and-coach/DTP0121-B-NSC-107-Springside-West-Secondary-College_Standard-Page_992x579_v1_FA.jpg","articleContent":"<h1>Better buses for Casey</h1> <p></p> <h3>Bus Route 863 will not service selected bus stops from Sunday 25 June 2023 until further notice.</h3><p>Bus stops that will not be serviced:</p><ul><li>Bushman Way/Evans Road (to Cranbourne West) – passengers may use the stop at Andretti Avenue/Evans Road</li><li>Breens Road/Evans Road (to Endeavour Hills) – passengers may use the stop at Fairhaven Boulevard/Evans Road</li><li>Central Park Way/Evans Road (to Cranbourne West) – passengers may use the stop at Fairhaven Boulevard/Evans Road</li><li>Montrose Way/Evans Road (to Cranbourne West) – passengers may use the stop at Duff Street/Evans Road</li></ul><h3>What’s changing on Route 863 Endeavour Hills SC – Cranbourne West via Hallam Road?</h3><ul><li>Route 863 will be extended south along Hallam Road and Evans Road to Cranbourne West Shopping Village.</li><li>The extension will provide residents along the route with better access to shops, schools and other transport services.</li><li>The extended route will also provide access to Cranbourne West Secondary College for students who live in Cranbourne West, Hampton Park and Lyndhurst.</li><li>Route 863 services will continue to be coordinated with trains at Hallam Station.</li></ul><h3>What’s changing on Route 895 Narre Warren South – Fountain Gate SC via Narre Warren Station?</h3><ul><li>Route 895 will be re-routed to provide direct access to businesses along Victor Crescent in Narre Warren.</li><li>Currently, Route 895 travels from Narre Warren Station along Webb Street and Overland Drive to Fountain Gate Shopping.</li><li>Route 895 will be re-routed, traveling from Narre Warren Station, along Webb Street, Princess Highway, Victor Crescent, and Overland Drive to Fountain Gate Shopping Centre.</li><li>Residents along the route will still have access to shopping, schools, and other transport services.</li><li>A number of Route 895 short trips will be extended to stop at all bus stops along the route.</li><li>Route 895 services will continue to be coordinated with trains at Narre Warren Station. </li></ul><p><span>Passengers should check their timetable before they travel. </span></p><p>To plan your journey, view the new timetable for <a href=\"https://www.ptv.vic.gov.au/route/timetable/15769/863-endeavour-hills-sc-cranbourne-west-via-hallam-rd/#RoutePage:::datetime=2023-06-25T02%3A00%3A00.000Z&amp;direction_id=287&amp;stop_id=-1&amp;_auth=33ef1864871e31c7f79278d984c63d9ed981eb25887b125b94c9d8b9c5cf4bad#RoutePage:::datetime=2023-06-26T02%3A00%3A00.000Z&amp;direction_id=279&amp;stop_id=-1&amp;_auth=6ed6ae7dc739e51878a2706b7836eac6468b924ef7869c9d2006dcb1d5f4b101\">Route 863</a> and <a href=\"https://www.ptv.vic.gov.au/route/timetable/15761/895-narre-warren-south-fountain-gate-sc-via-narre-warren-station/#RoutePage:::datetime=2023-06-25T02%3A00%3A00.000Z&amp;direction_id=272&amp;stop_id=-1&amp;_auth=aaf17ddfc4d58e389ccd577d0c90ee8f58a59ab015e8e034a2c55e83f49a96bd\">Route 895</a>, visit <a href=\"https://ptv.vic.gov.au/journey/\">Journey planner</a>, or call <a href=\"https://www.ptv.vic.gov.au/footer/customer-service/public-transport-call-centre/\">1800 800 007</a> to order a printed copy of your timetable.</p>","articleDescription":"From Sunday 26 June 2023, improvements will be introduced on bus routes 863 and 895 in the City of Casey.","pdfLinks":[],"imgLinks":[],"category":[],"eventImageFile":"3e05065bce27c2d6aaaa614847cd052a46c9ab07"}