{"title":"Public transport during the 2023 / 2024 cruise ship season","date":"2023-10-23","eventImage":"https://www.ptv.vic.gov.au/assets/PTV-default-site/Images/NextGen-App-news-article-banners/a23eea595c/App_News_Tram.jpg","articleContent":"<h1>Public transport during the 2023 / 2024 cruise ship season</h1> <p></p> <p>We extend a warm welcome to all cruise ship passengers arriving at Station Pier in Port Melbourne.</p><p>Public transport is the perfect way for you to get around the city and take in the sights before you travel back to the ship and set sail on the next chapter of your journey.</p><p>PTV has made it easy to use public transport during your stay. Simply purchase a <a href=\"https://www.ptv.vic.gov.au/tickets/myki/buy-a-myki-and-top-up\">myki card </a>and load money onto your myki and enjoy travel on public transport. You can purchase the myki card at Station Pier from the PTV ticket booth. A daily fare costs $10.00 for travel in Zone 1 &amp; 2 and $5.00 for Concession card holders.</p><p>To travel into Melbourne, catch the Bus 109 from Station Pier. This bus will take you directly into Stop 115 Casino/Queens Bridge Street, Southbank.</p><p>The first cruise ship will arrive in Port Melbourne on 23 October 2023, with ships to arrive every few days until 8 June 2024.</p><p>During cruise ship season, local passengers in the Port Melbourne area who catch Route 109 trams are encouraged to allow extra travel time as trams to the city are likely to be busy.</p><p>Tram Route 109 leaves from stop 129 – Beacon Cove/Light Rail at the end of Station Pier. It travels through Port Melbourne and along Collins Street, in the heart of the city.</p> <h3>Additional information</h3><ul><li>Please check the <a href=\"https://www.ptv.vic.gov.au/disruptions/disruptions-information/\">Disruptions page</a> for notification of any service changes that may affect your journey to and from the event.</li><li>To plan your route, use <a href=\"http://ptv.vic.gov.au/journey/\">Journey planner</a>.</li><li>Download the free <a href=\"https://www.ptv.vic.gov.au/footer/about-ptv/digital-tools/mobile-apps/\">PTV mobile app</a> for Android and iOS and access public transport information on the go.</li><li>Passengers requiring accessibility information and assistance, see <a href=\"http://ptv.vic.gov.au/getting-around/accessible-transport/\">Accessible transport</a>.</li><li>For information on ticketing for children and concessions, see <a href=\"https://www.ptv.vic.gov.au/tickets/fares/concession/children/\">Children</a> and <a href=\"https://www.ptv.vic.gov.au/tickets/fares/concession/\">Concessions</a>.</li><li>Passengers needing further information or assistance, please call <a href=\"https://www.ptv.vic.gov.au/footer/customer-service/public-transport-call-centre/\">1800 800 007</a> prior to travelling.</li></ul><h3>Subscribe for weekly travel updates</h3><p>Keep up to date with planned disruptions on your line/route and across the network by subscribing to <a href=\"https://info.ptv.vic.gov.au/link/id/zzzz59cae94adb281777Pzzzz59cc81c07fee9925/page.html?prompt=1&amp;parent_id=zzzz59cae945a9c01491%20\">our weekly travel update email</a>.</p><h3>Follow us on social media</h3><p>For official updates and event information from Public Transport Victoria, follow us on <a href=\"https://twitter.com/ptv_official\">Twitter</a>. If you need help or a question answered, call us on <a href=\"https://www.ptv.vic.gov.au/customer-service/public-transport-call-centre/\">1800 800 007</a>.</p>","articleDescription":"Public transport is the perfect way for you to get around the city and take in the sights, before you travel back to the ship and set sail.","pdfLinks":[],"imgLinks":[],"category":[],"eventImageFile":"a23eea595c92c1df18cb170a7f560c2c47797f14"}