{"title":"Tram stop upgrade – Stop 4, William Street/Collins Street","date":"2023-03-15","eventImage":"https://www.ptv.vic.gov.au/assets/Uploads/NSB-disruptions/2021/12-December/tram-asset.png","articleContent":"<p>We’re upgrading Stop 4, William/Collins Street, to create raised side platforms, which will be fully integrated with Melbourne’s expanding fleet of low-floor trams. The upgrade will improve safety and provide level-access boarding for passengers using Route 58. </p><p><strong>Better facilities at Stop 4<br /> <br /> </strong>The upgraded Stop 4 will fully integrate with E-Class and other low-floor trams running on Route 58, allowing everyone to get on and off the tram easily and safely.</p><p>The platforms will feature new shelters, seating, improved lighting, and new audio and visual passenger information displays.</p><p>The upgrade to Stop 4 will also enhance safety by separating passengers from traffic, cyclists and trams with more pedestrian crossing points, new collision barriers and fencing.</p><p><strong>Improved connections for passengers</strong></p><p>Stop 4 is a heavily used stop within the CBD and allows passengers to connect to tram routes 11, 12, 48 and 109.<strong><br /> <br /> </strong>The upgrade will create more accessible interchanges for passengers requiring these other low-floor tram services from nearby Stop 3 on Collins Street. The introduction of E-Class trams on Route 58 will also provide better level-access connectivity to key destinations, including South Yarra Station, Queen Victoria Market and Melbourne Zoo.<br /> <br /> <strong>When will the upgrade happen?</strong></p><p>Major 24-hour works will take place from <strong>Tuesday 1 February to Monday 7 February 2022.</strong> <br /> <br /> During this time Stop 4 will be closed and the section of William Street, between Collins and Bourke streets, will be closed. <br /> <br /> More information about the work will be provided nearer the time.</p>","articleText":"We’re upgrading Stop 4, William/Collins Street, to create raised side platforms, which will be fully integrated with Melbourne’s expanding fleet of low-floor trams. The upgrade will improve safety and provide level-access boarding for passengers using Route 58. Better facilities at Stop 4  The upgraded Stop 4 will fully integrate with E-Class and other low-floor trams running on Route 58, allowing everyone to get on and off the tram easily and safely.The platforms will feature new shelters, seating, improved lighting, and new audio and visual passenger information displays.The upgrade to Stop 4 will also enhance safety by separating passengers from traffic, cyclists and trams with more pedestrian crossing points, new collision barriers and fencing.Improved connections for passengersStop 4 is a heavily used stop within the CBD and allows passengers to connect to tram routes 11, 12, 48 and 109.  The upgrade will create more accessible interchanges for passengers requiring these other low-floor tram services from nearby Stop 3 on Collins Street. The introduction of E-Class trams on Route 58 will also provide better level-access connectivity to key destinations, including South Yarra Station, Queen Victoria Market and Melbourne Zoo.  When will the upgrade happen?Major 24-hour works will take place from Tuesday 1 February to Monday 7 February 2022.   During this time Stop 4 will be closed and the section of William Street, between Collins and Bourke streets, will be closed.   More information about the work will be provided nearer the time.","articleDescription":"We’re upgrading Stop 4, William/Collins Street, to create raised side platforms, integrated with Melbourne’s expanding fleet of low-floor trams.","pdfLinks":[],"imgLinks":[],"category":[],"eventImageFile":"8b800c6b2517a8780665b546879b7cd7280432c1"}