{"title":"New bus interchange on the south side of Tarneit Railway Station","date":"2023-11-19","eventImage":"https://www.ptv.vic.gov.au/assets/default-site/footer/about-ptv/improvements-and-projects/bus-and-coach/DTP0447-B-NSC-VLine-CC1647-November-TT-change_Standard-Page_XL-1200x744_v1_FA.jpg","articleContent":"<h1>New bus interchange on the south side of Tarneit Railway Station</h1> <p></p> <p><strong>From 19 November 2023, a new bus interchange will begin operating on the south side of Tarneit Railway Station.</strong></p><p>Eight bus routes will be relocated from the north side of the railway station to the new interchange on the south side of the railway station.</p><p>The following routes will use the new bus interchange on the south side of the station:</p><ul><li>Route 150 (Williams Landing Station – Tarneit Station via Sayers Rd)</li><li>Route 151 (Williams Landing Station – Tarneit Station via Westmeadows La)</li><li>Route 152 Tarneit Station – Williams Landing Station via Palmers Rd)</li><li>Route 160 (Hoppers Crossing Station – Tarneit Station via Morris Rd)</li><li>Route 167 (Hoppers Crossing Station – Tarneit Station via Werribee Plaza SC)</li><li>Route 170 (Werribee Station – Tarneit Station via Werribee Plaza SC)</li><li>Route 180 (Werribee Station – Tarneit Station via Tarneit Rd)</li><li>Route 182 (Werribee Station – Tarneit Station via Tarneit West).</li></ul><p>The new bays on the south side will provide passengers with direct access to the train station.</p><p>From 19 November, routes 150, 151, 167 and 170 will turn right on to Leakes Rd from Derrimut Rd to access the new interchange. Buses will enter and exit the new bus interchange from Sunset Views Boulevard, via Leakes Road.</p><p>To ensure safety for passengers, Stop ID 50204 on Derrimut Road (north bound) across the road from the Tarneit Central Shopping Centre will be closed from 19th November 2023 until further notice. This is necessary to ensure the safety of passengers and road users while a safety issue is evaluated and addressed.</p><p>A new temporary stop will be provided on Leakes Road to provide passengers with access to the shopping centre - this change will add approximately 200m in walking distance from the original stop on Derrimut Road.</p><p>Passengers using bus Routes 150, 151, 167 and 170 who want to access the Tarneit Central Shopping Centre will need to walk from the temporary stop on Leakes Road. Alternatively, passengers can travel onto the new interchange at the train station and catch a bus to bring them back to the bus stop on Derrimut Road (south bound) directly outside the Tarneit Shopping Centre (Stop ID 50205).</p><p><img src=\"DTP0447-B-NSC-VLine-CC1647-November-TT-change_Map_2000px_v3_FA-v2.jpg\" alt=\"Map of temporary bus stop closures and temporary stops at the south side of Tarneit Station.\" width=\"2000\" height=\"2123\" loading=\"lazy\" /></p><p>Bus services to the north side of the Tarneit Railway Station, including the Tarneit North Flexiride and Skybus services, as well as V/Line rail replacements on the Geelong and Warrnambool lines, will continue to use the existing bus bays on the north side of the railway station.</p><p>Timetables for buses operating from the new interchange will be adjusted, existing span of hours and frequency of all bus services will remain unchanged.</p><p>Check your timetables before you travel.</p><p>Timetables and more information will be available at <a href=\"https://www.ptv.vic.gov.au/home/\">ptv.vic.gov.au</a>, <a href=\"https://www.ptv.vic.gov.au/footer/about-ptv/digital-tools/mobile-apps/\" target=\"_blank\">PTV app</a> or by calling PTV on 1800 800 007 from 15 September.</p><p><strong>You can provide feedback on the temporary closure of the bus stop on Derrimut Road and the new temporary bus stop on Leakes Road. </strong></p><p>To provide feedback please call 1800 800 007.</p>","articleDescription":"From 19 November 2023, a new bus interchange will begin operating on the south side of Tarneit Railway Station.","pdfLinks":[],"imgLinks":["https://www.ptv.vic.gov.au/assets/default-site/footer/about-ptv/improvements-and-projects/bus-and-coach/DTP0447-B-NSC-VLine-CC1647-November-TT-change_Map_2000px_v3_FA-v2.jpg","https://www.ptv.vic.gov.au/assets/default-site/footer/about-ptv/improvements-and-projects/bus-and-coach/DTP0447-B-NSC-VLine-CC1647-November-TT-change_Map_2000px_v3_FA-v2.jpg"],"category":[],"eventImageFile":"faff0b8b346c58baca539109b69e894026b238af"}