{"title":"Extra bus services to Chadstone Shopping Centre connecting to trains and trams","date":"2023-09-30","eventImage":null,"articleContent":"<h1>Extra bus services to Chadstone Shopping Centre connecting to trains and trams</h1> <p></p> <h2></h2> <p>To accommodate travel to and from Chadstone Shopping Centre during the upcoming spring and summer shopping seasons from late 2023 to early 2024, we're introducing two additional shuttle bus services. The first service will run between Oakleigh Station and Chadstone Shopping Centre, while the second service will run between Burwood and Chadstone Shopping Centre and connecting to both Holmesglen Station and the Route 75 tram. These services will provide more convenient transportation options for shoppers.</p><h3>To and from Oakleigh Station</h3><p>Extra shuttle bus services will be running between Oakleigh Station and Chadstone Shopping Centre on weekends and public holidays from Saturday 30 September 2023 to Sunday 28 January 2024 to give passengers more travel options during the busy spring and summer period.</p><ul><li>Shuttle bus services will run on weekends and public holidays approximately every 14 minutes.</li><li>When combined with existing bus routes between Oakleigh Station and Chadstone Shopping Centre, there are services on average every 10 minutes.</li><li>Shuttle bus services will support the busiest shopping period between Black Friday (Friday 24 November 2023) and the day before Christmas day (Sunday 24 December 2023) by operating at an even greater frequency.</li><li>On Boxing Day, shuttle buses will run approximately every 5 minutes.</li><li>Services will run between 8am and 10pm on most Saturdays and between 9am and 8pm most Sundays.</li><li>Hours will be extended from 7am/8am to midnight for busy shopping days such as Black Friday sales (Friday 24 November and Saturday 25 November), Boxing Day sales (Tuesday 26 December) and in the lead up to Christmas Day.</li></ul><h4>Shuttle bus services will depart from:</h4><p><strong>Oakleigh Station</strong></p><ul><li>Buses will depart from the existing bus stop for routes 800, 802, 804, and 862 (i.e. Bay B) on the <a href=\"https://www.ptv.vic.gov.au/stop/10004/oakleigh-stationportman-st/2/bus/\">westbound side of Portman Street</a>.</li></ul><p><strong>At Chadstone Shopping Centre</strong></p><ul><li>Buses will depart from the existing bus stop for Route 742 on the <a href=\"https://www.ptv.vic.gov.au/stop/11293/golf-links-drprince-of-wales-ave/2/bus/\">centre island (Bay 6)</a>.</li></ul><p>Bus routes 625, 742, 800, 802, 804, 862, 900 and 903 also regularly run between Oakleigh Station and Chadstone Shopping Centre every day.</p><p>Use our <a href=\"https://www.ptv.vic.gov.auhttps:///https:/ptv.vic.gov.au/journey/\">Journey planner</a> or check <a href=\"https://https:/ptv.vic.gov.au/timetables\">Timetables</a> to plan your journey.</p><h3>To and from Burwood via Holmesglen Station</h3><p>Extra bus services will be running between Burwood and the Route 75 tram via Holmesglen Station on the Glen Waverley Line to Chadstone Shopping Centre on weekends and public holidays from Saturday 11 November 2023 to Monday 1 January 2024 to give passengers more travel options during the busy spring and summer period.</p><ul><li>These bus services will operate within the existing Route 903 timetable on weekends and public holidays, reducing the waiting time for passengers. Combine with the existing Route 903 services, in this section of Warrigal Road, buses will operate approximately every 10-15 minutes.</li><li>Services will run between 8am and 10pm on Saturdays and between 9am and 8pm on Sundays.</li></ul><h4>Shuttle bus services will depart from:</h4><p><strong>Burwood</strong></p><ul><li>Buses will depart from the existing bus stop for Route 903 at <a href=\"https://www.ptv.vic.gov.au/stop/20482/burwood-hwywarrigal-rd/2/bus/#StopPage:::datetime=2023-10-18T15%3A35%3A30.467Z&amp;directionId=215&amp;showAllDay=false&amp;_auth=c757b1a801b6537fafe0864ab810d261d436ce76469a6526b4d90cc691f7b554\">Burwood Highway/Warrigal Road</a> on the southbound side of Warrigal Road.</li></ul><p><strong>At Chadstone Shopping Centre</strong></p><ul><li>Buses will depart from the existing bus stop for Route 903 for Altona bound services on the <a href=\"https://www.ptv.vic.gov.au/stop/11293/golf-links-drprince-of-wales-ave/2/bus/\">centre island (Bay 2).</a> </li></ul><p>Bus routes 624 and 903 also run between Holmesglen Station and Chadstone Shopping Centre every day. </p><p>Use our <a href=\"https://www.ptv.vic.gov.auhttps:///https:/ptv.vic.gov.au/journey/\">Journey planner</a> or check <a href=\"https://https:/ptv.vic.gov.au/timetables\">Timetables</a> to plan your journey.</p><p>Normal myki fares apply.</p><p>Bus services within the myki zone are cashless. Remember to top up your myki before you travel. You can top up <a href=\"https://https:/www.ptv.vic.gov.au/mykitopup\">online</a> and instantly via the <a href=\"https://https:/www.ptv.vic.gov.au/footer/about-ptv/digital-tools/mobile-apps/\">PTV app</a>.</p><p>Both of these bus services have been funded by Chadstone Shopping Centre.</p><p> </p>","articleDescription":"We're introducing two additional shuttle bus services to accommodate travel to and from Chadstone Shopping Centre during spring and summer shopping.","pdfLinks":[],"category":[],"imgLinks":[]}