{"title":"Melbourne Tram Refranchising","date":"2024-06-28","eventImage":null,"articleContent":"<p>The 18-month competitive procurement process provided time to deliver reform and the opportunity to drive best value from one of Victoria’s largest, most recognised transport assets. The next tram operations and maintenance contract commences on 1 December 2024, with <strong>Transdev John Holland</strong> as the franchisee.</p><p><a href=\"https://www.premier.vic.gov.au/making-worlds-biggest-tram-network-even-better\">Read the announcement</a></p><h2>Tougher performance regime, improving tram reliability</h2><p>Our focus is on providing Victorians with reliable, punctual services and minimising the impact of planned and unplanned disruptions. The new Tram Franchise Agreement incentivises the Franchisee to deliver more punctual and reliable services across all routes, at all times of the day. The performance regime has been updated based on current usage data, load requirements, new technology and infrastructure. The new Tram Franchise Agreement will drive continuous improvement, with refined metrics to improve punctuality and reliability, providing more certainty to customers.</p><h2>Improved customer experience and accessibility outcomes</h2><p>Over time, the new Franchise will deliver improved passenger information to all passengers, including those with accessibility requirements and passengers who are culturally and linguistically diverse.</p><p>A new ‘Right Tram, Right Trip’ Key Performance Indicator (KPI) makes sure our operator commits to the use of a specific fleet type on a particular service. This new KPI aims to improve confidence for passengers, giving greater certainty that low floor trams will show up when passengers expect them to.</p><h2>More employment opportunities for priority job seekers</h2><p>New social procurements targets will ensure the Franchisee meets stronger targets with more employment opportunities for women, Victorian Aboriginal people, and other Victorian Priority Jobseekers, with abatements if targets are not met. For the first time in any Victorian public transport franchise, board gender parity is targeted from day one and workforce parity by end of term.</p><h2>Contact us</h2><p>For more information, email <a href=\"mailto:mr5@transport.vic.gov.au\">mr5@transport.vic.gov.au</a>.</p>","articleText":"The 18-month competitive procurement process provided time to deliver reform and the opportunity to drive best value from one of Victoria’s largest, most recognised transport assets. The next tram operations and maintenance contract commences on 1 December 2024, with Transdev John Holland as the franchisee.Read the announcementTougher performance regime, improving tram reliabilityOur focus is on providing Victorians with reliable, punctual services and minimising the impact of planned and unplanned disruptions. The new Tram Franchise Agreement incentivises the Franchisee to deliver more punctual and reliable services across all routes, at all times of the day. The performance regime has been updated based on current usage data, load requirements, new technology and infrastructure. The new Tram Franchise Agreement will drive continuous improvement, with refined metrics to improve punctuality and reliability, providing more certainty to customers.Improved customer experience and accessibility outcomesOver time, the new Franchise will deliver improved passenger information to all passengers, including those with accessibility requirements and passengers who are culturally and linguistically diverse.A new ‘Right Tram, Right Trip’ Key Performance Indicator (KPI) makes sure our operator commits to the use of a specific fleet type on a particular service. This new KPI aims to improve confidence for passengers, giving greater certainty that low floor trams will show up when passengers expect them to.More employment opportunities for priority job seekersNew social procurements targets will ensure the Franchisee meets stronger targets with more employment opportunities for women, Victorian Aboriginal people, and other Victorian Priority Jobseekers, with abatements if targets are not met. For the first time in any Victorian public transport franchise, board gender parity is targeted from day one and workforce parity by end of term.Contact usFor more information, email mr5@transport.vic.gov.au.","articleDescription":"The Victorian government has awarded a new long term service contract - the operations and maintenance contract for Melbourne’s Tram franchise. The iconic tram network spans 24 routes, with 250 kilometres of double track, around 500 trams, and over 1600 stops. The network services over 147 million passenger trips per year.","pdfLinks":[],"imgLinks":[],"category":[]}