{"title":"Proposed changes to the Gisborne bus network","date":"2024-03-12","eventImage":null,"articleContent":"<h1>Proposed changes to the Gisborne bus network</h1> <p></p> <p>We’re improving the Gisborne bus network and want to hear your feedback on the proposed changes.</p><p>The proposed changes include reforming routes 473 and 474, updating the Bullengarook service, and integrating the Gisborne Town School Special into the public network. The proposed changes will allow the network to run more efficiently and provide greater coverage across Gisborne. We are consulting with the Gisborne community to help shape these changes.</p><p>You can provide feedback on the proposed changes via our online survey, attending an information session or by calling the PTV call centre on 1800 800 007 by Tuesday March 12.</p><h3>Summary of the proposed changes to the Gisborne bus network</h3><p>We are proposing to:</p><ul><li>Reform routes 473 and 474 to create a simple two-way loop service around Gisborne, allowing passengers to catch a bus in either direction to access all points across the loop, which covers the Gisborne township.</li><li>Changing route 474 from an on-demand service to a fixed-route service.</li><li>Providing a dedicated pre-booked service to Bullengarook, increasing the number of services on weekdays, and introducing weekend services.</li><li>Integrating the over-booked Gisborne Town School Special into the public network.</li><li>Renumbering routes – route 473 will change to 73, route 474 will change to 74.</li></ul><h3>Have your say</h3><p>To review the proposed changes and have your say, please visit <a href=\"https://engage.vic.gov.au/Gisborne-bus\">engage.vic.gov.au/Gisborne-bus</a> by Tuesday 12 March.</p><p>We are hosting three pop-up information sessions in Gisborne and invite you to attend.</p><ul><li>Thursday 15 February 3:00pm – 6:00pm<br />Gisborne Train Station, Station Rd, Gisborne</li><li>Wednesday 21 February 11:00am – 2:00pm<br />Gisborne Library, 8 Hamilton St, Gisborne</li><li>Wednesday 21 February 2:00pm – 4:00pm<br />Coles Gisborne, Robertson St, Gisborne</li></ul><p>You may also share your feedback by calling the PTV call centre on 1800 800 007 by Tuesday 12 March.</p>","articleDescription":"We’re improving the Gisborne bus network and want to hear your feedback on the proposed changes to improve efficiency and meet passenger demands.","pdfLinks":[],"category":[],"imgLinks":[]}