{"title":"Victoria's Pride","articleDescription":"At Gertrude Street and Smith Street, Fitzroy/Collingwood","date":"2026-01-19","eventImage":null,"link":"https://transport.vic.gov.au/news-and-resources/events-and-public-transport/victorias-pride","id":"6d5528b6-4c74-4ad4-b784-c4f3822bf640","event":true,"articleContent":"<div><p>The 5th edition of Victoria's Pride Street Party will be back on Sunday 8 February 2026 - a celebration of progress, love, and diversity!</p></div><div><h2>Metropolitan train</h2><h4>Getting to and from Gertrude Street</h4><p>Passengers on the Cranbourne, Pakenham or Sunbury lines wishing to experience the Metro Tunnel to get to Gertrude Street can use Town Hall Station and:</p><ul><li>Catch the Route 11 tram on Collins Street to Stop 13 on Brunswick Street. </li><li>Catch the Route 12 tram on Collins Street to Stop 15 on Smith St/Victoria Pde </li><li>Catch the Route 109 tram on Collins Street to Stop 15 on Smith St/Victoria Pde </li><li>Walk 5 minutes to Bourke Street and catch the Route 96 tram along Nicholson Street to Stop 11. </li></ul><h2>Metropolitan tram</h2><h4>Getting to and from Gertrude Street</h4><ul><li>Smith St/Victoria Pde, tram route 109 stop 15. Low-floor trams available with level access stop. </li><li>Smith St/Victoria Pde, tram route 12 stop 15. This route is not currently serviced by low-floor trams. </li><li>Brunswick St/Gertrude St, tram route 11 stop 13. </li><li>Nicholson St/Gertrude St, tram route 96 stop 11 at Melbourne Museum. Low-floor trams available with level access stop. </li><li>NOTE: Tram route 86 will have bus replacements operating between Stop 11 (Melbourne Museum) and Stop 25 (Clifton Hill Interchange), diverting around the Victoria's Pride event via Nicholson and Johnston streets. <a href=\"https://transport.vic.gov.au/disruptions/disruptions-information/article/route-86-service-changes-from-first-service-to-last-service-on-sunday-8-february-2026\">See more information here.</a> </li></ul><h2>Metropolitan bus</h2><h4>Getting to and from Gertrude Street</h4><p>Passengers can catch the following buses close to Gertrude St</p><ul><li>Smith St/Johnston Street routes 207, 202 and 200. </li><li>Smith St/Victoria Pde routes 908, 906, 305, 907, 905, 304, 302, 303, 309, 318 and 350. </li></ul><h2>Additional information</h2><ul><li>Download our free <a href=\"https://transport.vic.gov.au/plan-a-journey/public-transport-tools-and-resources/travel-tips-and-resources/mobile-apps-for-public-transport\">mobile apps</a> for Android and iOS to get public transport information on the go. You can also <a href=\"https://transport.vic.gov.au/tickets-and-myki/myki/top-up-your-myki\">top up your myki instantly</a> in the app.</li><li>If you need accessibility information and assistance, see <a href=\"https://transport.vic.gov.au/accessibility\">Accessibility</a>.</li><li>Top up your myki before travelling or set Auto Top Up so you never need to top up again. For more information, see <a href=\"https://transport.vic.gov.au/tickets-and-myki/myki/top-up-your-myki/auto-top-up\">Auto Top Up</a>.</li><li><a href=\"https://transport.vic.gov.au/tickets-and-myki/myki/myki-types/mobile-myki\">Mobile myki</a> is a new way to travel with myki. It’s a digital myki on your Android phone on the Google Wallet™ app.</li><li>For information about tickets for children and concessions, see <a href=\"https://transport.vic.gov.au/tickets-and-myki/myki/myki-types/child-myki\">Children</a> and <a href=\"https://transport.vic.gov.au/tickets-and-myki/myki/myki-types/concession-myki\">Concessions</a>.</li><li>If you need more information or special assistance, please call <a href=\"https://transport.vic.gov.au/contact-us/public-transport-enquiries\">1800 800 007</a> before travelling.</li></ul><p> </p></div>","articleText":"The 5th edition of Victoria's Pride Street Party will be back on Sunday 8 February 2026 - a celebration of progress, love, and diversity!\nMetropolitan trainGetting to and from Gertrude StreetPassengers on the Cranbourne, Pakenham or Sunbury lines wishing to experience the Metro Tunnel to get to Gertrude Street can use Town Hall Station and:Catch the Route 11 tram on Collins Street to Stop 13 on Brunswick Street. Catch the Route 12 tram on Collins Street to Stop 15 on Smith St/Victoria Pde Catch the Route 109 tram on Collins Street to Stop 15 on Smith St/Victoria Pde Walk 5 minutes to Bourke Street and catch the Route 96 tram along Nicholson Street to Stop 11. Metropolitan tramGetting to and from Gertrude StreetSmith St/Victoria Pde, tram route 109 stop 15. Low-floor trams available with level access stop. Smith St/Victoria Pde, tram route 12 stop 15. This route is not currently serviced by low-floor trams. Brunswick St/Gertrude St, tram route 11 stop 13. Nicholson St/Gertrude St, tram route 96 stop 11 at Melbourne Museum. Low-floor trams available with level access stop. NOTE: Tram route 86 will have bus replacements operating between Stop 11 (Melbourne Museum) and Stop 25 (Clifton Hill Interchange), diverting around the Victoria's Pride event via Nicholson and Johnston streets. See more information here. Metropolitan busGetting to and from Gertrude StreetPassengers can catch the following buses close to Gertrude StSmith St/Johnston Street routes 207, 202 and 200. Smith St/Victoria Pde routes 908, 906, 305, 907, 905, 304, 302, 303, 309, 318 and 350. Additional informationDownload our free mobile apps for Android and iOS to get public transport information on the go. You can also top up your myki instantly in the app.If you need accessibility information and assistance, see Accessibility.Top up your myki before travelling or set Auto Top Up so you never need to top up again. For more information, see Auto Top Up.Mobile myki is a new way to travel with myki. It’s a digital myki on your Android phone on the Google Wallet™ app.For information about tickets for children and concessions, see Children and Concessions.If you need more information or special assistance, please call 1800 800 007 before travelling.","pdfLinks":[],"imgLinks":[]}